[{"id":"Text-1762842160488","text":"Linear Algebra","fontSize":29,"x":93,"y":59,"width":223,"height":47,"bgColor":"#EBEBEB"},{"id":"Container-1762842180479","elements":[{"id":"Text-1762842185999","text":"Algebra","x":3,"y":12,"width":123,"height":33,"bgColor":"#EBEBEB"},{"id":"Note-1762842197833","text":"<div>The Arabic word \"al-jabr\" means \"the reunion of broken parts\" or \"restoration,\" referring to the process of moving negative terms from one side of an equation to the other to simplify and solve it.</div><div>Algebra is a fundamental branch of mathematics that serves as a generalization of arithmetic.</div><div>While arithmetic uses specific numbers and operations (like 2 + 3 = 5), algebra introduces variables (symbols, usually letters like 3x or 4y) to represent unknown numbers or quantities that can change.</div>The primary objective in elementary algebra is to find the unknown value(s) by manipulating the equation according to specific rules to isolate the variable.\nExample Solution: x + 5 = 12<div>General Algebra, deals with all kinds of expressions and equations, including those with high-order powers (exponents), products of variables, roots, and complex functions.\nExamples: Quadratic equations (x^2 + 2x - 3 = 0), Polynomial equations (x^3 - y + 5 = 0), or Transcendental equations (sin(x) = x).</div>","x":21,"y":44,"width":950,"height":359}],"x":113,"y":477,"width":1006,"height":424,"bgColor":"#F0F0F0"},{"id":"Container-1762843009494","elements":[{"id":"Text-1762843026274","text":"Linear Algebra","x":15,"y":9,"width":136,"height":33,"bgColor":"#EBEBEB"},{"id":"Note-1762843050827","text":"Focuses only on linear relationships. \nA relationship is linear if the variables appear only with a power of one, and are not multiplied together or used as arguments for non-linear functions (like sin or log).\nExamples: Systems of linear equations (3x + 2y - z = 5), which geometrically represent lines, planes, or hyperplanes.<div>In Algebra, we typically solve for a single unknown variable, x.\nIn Linear Algebra, we often solve for a vector x, which is an ordered list of many unknown variables (x1, x2, ...., xn) simultaneously.</div><div>In Algebra, we use operations like addition and multiplication on scalars.\nIn Linear Algebra, we define operations (like matrix multiplication) on vectors and matrices. These operations correspond to linear transformations (like rotation, scaling, or shearing) in space.</div>","x":14,"y":50,"width":1041,"height":408}],"x":115,"y":937,"width":1135,"height":521,"bgColor":"#F0F0F0"},{"id":"Container-1762854571757","elements":[{"id":"Text-1762854579540","text":"Arithmatic","fontSize":19,"x":17,"y":15,"width":120,"height":32,"bgColor":"#EBEBEB"},{"id":"Note-1762854680334","text":"1) Mean - average \n2) Median - sort the values, and take the middle(odd number of data) or mean of the middles(even number of data)\n3) Mode - most column value in a data set\n4) Varience - average of the squared differences from mean\n5) Standard Deviation - square root of the varience\n6) Sample Varience - where while average we do -1 of total elements\n7) Percentile : indicates the value below which a given percentage of observations in a group falls\n8) Moments - Mean, Varience, Skew, Kurtosis\n9) Covariance - ","x":25,"y":48,"width":839,"height":257}],"x":114,"y":137,"width":887,"height":316,"bgColor":"#F0F0F0"}]