{"id":null,"name":"AWS","data":{"id":"root","size":{"width":1571,"height":905},"pan":{"x":744.2315761126292,"y":418.62748358789236,"scale":0.7866640115401425},"children":[{"id":"node-1767794057986","position":{"x":989.9505004882812,"y":576.245849609375},"size":{"width":1381,"height":829},"type":"Container","title":"AWS","description":"1. What is Cloud Computing?\nAt its simplest, Cloud Computing is the on-demand delivery of IT resources over the internet with pay-as-you-go pricing. Instead of buying, owning, and maintaining physical data centers and servers, you access technology services, such as computing power, storage, and databases, from a provider like AWS.\n\nKey Characteristics:\nOn-Demand Self-Service: You can provision resources (like a server) with a few clicks whenever you need them.\n\nPay-as-you-go: You only pay for what you use, turning capital expenses (CapEx) into variable expenses (OpEx).\n\nElasticity: You can scale up (add more power) or scale down (remove power) instantly based on demand.\n\nAgility: It allows you to innovate faster because you can experiment and deploy applications in minutes rather than weeks.\n\n2. Brief Introduction to AWS\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. Launched in 2006, it was the first major player in the cloud market and currently offers over 200 fully featured services from data centers globally.\n\nWhy AWS?\nExperience: Being the pioneer, AWS has the most mature and refined service offerings.\n\nBreadth and Depth: From basic virtual servers to advanced Artificial Intelligence, Machine Learning, and Internet of Things (IoT) tools.\n\nSecurity: AWS is architected to be the most flexible and secure cloud computing environment available today.\n\nGlobal Footprint: It provides the largest global infrastructure, allowing you to deploy your applications to users around the world with minimal latency.","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/722e840acdfecc2ee3046f20fad392ff66b65801/images/aws/aws.svg","pan":{"x":10.741947215728306,"y":-381.6865592518327,"scale":0.32968603791325596},"children":[{"id":"node-1767794337597","position":{"x":119.84652709960938,"y":-343.132625579834},"size":{"width":4076.0136108398438,"height":2205.771270751953},"type":"Container","title":"Global Architecture","description":"1. The AWS Global Footprint\nAWS does not just have \"one big cloud.\" It is a massive network of interconnected hardware distributed across the planet. This architecture is organized into a specific hierarchy:\n\nA. Regions\nA Region is a physical location in the world where AWS has a cluster of data centers.\n\nNaming: They have names like us-east-1 (N. Virginia) or eu-west-2 (London).\n\nIsolation: Each Region is completely independent. Data does not move between regions unless you explicitly tell it to.\n\nSelection Criteria: You choose a region based on Compliance (data laws), Proximity (closeness to your users), and Cost (prices vary by region).\n\nB. Availability Zones (AZs)\nInside every Region, there are multiple Availability Zones. An AZ is one or more discrete data centers with redundant power, networking, and connectivity.\n\nThe \"Magic\" Number: Almost every region has at least 3 AZs.\n\nRedundancy: AZs are physically separated by miles (to protect against fires or floods) but connected by ultra-fast, low-latency private fiber.\n\nHigh Availability: By launching your app in two or more AZs, your app stays online even if one entire data center fails.\n\n2. The Service Scope Model\nFollowing your requested model, we categorize services based on where they \"live\" in this architecture:\n\nGlobal Services\nThese services are managed by AWS at a global level. You don't pick a region for them.\n\nIAM: Users and permissions are the same worldwide.\n\nRoute 53: AWS’s global DNS (Domain Name System) service.\n\nCloudFront: A Content Delivery Network (CDN) that uses Edge Locations to cache data closer to users.\n\nRegional Services\nMost services are scoped to a specific region.\n\nS3 (Simple Storage Service): You create a \"Bucket\" in a specific region. AWS then automatically replicates that data across all AZs in that region.\n\nDynamoDB: A NoSQL database that automatically scales across the region.\n\nAZ-Specific Services\nThese services live inside a single Availability Zone.\n\nEC2 Instances: A virtual server is physically located in one AZ.\n\nEBS Volumes: A virtual hard drive must be in the same AZ as the server it is attached to.\n\nSubnets: When you design a network (VPC), each subnet exists within one specific AZ.","pan":{"x":-263.38052334164,"y":-1438.375716301195,"scale":0.5005392201384677},"children":[{"id":"node-1767794519228","position":{"x":3113.527099609375,"y":-438.2537612915039},"size":{"width":3743.471466064453,"height":2206.6690063476562},"type":"Container","title":"Region","description":"1. What is an AWS Region?\nA Region is a physical location in the world where AWS has a cluster of data centers. Each Region is designed to be completely isolated from the others.\n\nRegional Scope: When you create a resource in a region, it stays in that region. For example, an S3 bucket in London does not automatically exist in New York.\n\nData Sovereignty: Regions allow you to keep data within specific borders to comply with local laws (e.g., GDPR in Europe).\n\n2. Core Regional Services\nThese services operate at the Regional level. This means AWS handles the replication across multiple Availability Zones (AZs) for you automatically to ensure high availability.\n\nA. Amazon S3 (Simple Storage Service)\nRole: Object storage (files, images, backups).\n\nRegional Nature: When you upload a file to an S3 bucket, AWS automatically replicates that file across at least three Availability Zones within that Region. If one data center goes down, your file is still safe.\n\nB. Amazon DynamoDB\nRole: A fast NoSQL database.\n\nRegional Nature: It is a \"Regional Service\" because you don't pick a specific server or AZ for it. It lives across the entire Region, providing massive scale and 99.99% durability.\n\nC. AWS Lambda\nRole: \"Serverless\" compute. You upload code, and it runs in response to events.\n\nRegional Nature: You deploy the function to a Region. AWS manages the underlying servers across the AZs to make sure your code runs when needed.\n\nD. Amazon VPC (Virtual Private Cloud)\nRole: Your private network in the cloud.\n\nRegional Nature: A VPC spans the entire Region. While you will later put \"Subnets\" into specific AZs, the VPC itself is a Regional container for your network.","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/1870fa57dab6d65be177a5a9d7552e51e9e2f0ff/images/aws/region.svg","pan":{"x":-85.72334396436398,"y":-25.291399931781342,"scale":4.870579550355811},"children":[{"id":"node-1767870288784","position":{"x":10,"y":9.87896728515625},"size":{"width":450,"height":300},"type":"Container","title":"Availability Zone","description":"1. What is an Availability Zone (AZ)?\nAn AZ is one or more discrete data centers with redundant power, networking, and connectivity within an AWS Region.\nPhysical Separation: AZs are separated by several miles to protect against \"shared fate\" disasters like fires, floods, or power grid failures.\nLogical Connection: They are connected by high-bandwidth, ultra-low-latency networking, allowing them to act like a single logical data center for your applications.\n\n2. AZ-Specific Services\nThese are resources that are \"locked\" into a single AZ. If that specific AZ goes down, the resource goes down unless you have built a backup in a different AZ.\nA. Amazon EC2 (Elastic Compute Cloud)\nRole: Virtual Servers.\nAZ Nature: When you launch an EC2 instance, you must select a specific AZ (e.g., us-east-1a). The \"virtual machine\" physically runs on a rack in that specific data center.\nB. Amazon EBS (Elastic Block Store)\nRole: Virtual hard drives for your EC2 servers.\nAZ Nature: An EBS volume is tied to a specific AZ. To attach a hard drive to a server, both must be in the same AZ. You cannot attach an EBS volume in us-east-1a to an EC2 in us-east-1b.\nC. VPC Subnets\nRole: A slice of your network's IP range.\nAZ Nature: While a VPC is regional, a Subnet resides entirely within one AZ. This is the most important rule for network architects: 1 Subnet = 1 AZ.\n\n3. The \"High Availability\" Strategy\nBecause these services are AZ-specific, the goal for any professional architect is Multi-AZ Deployment.\nThe Problem: If you put your server and database in only one AZ, and that data center loses power, your website goes offline.\nThe Solution: You launch one EC2 in AZ-A and another EC2 in AZ-B. You then use a Load Balancer (a Regional service) to split traffic between them. If one AZ fails, the other continues to serve your users.","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/0b7ac3f365bc3efae2caa2dfd1942e98c539327a/images/aws/az.svg","pan":{"x":-39.816149218031285,"y":-85.36892998344905,"scale":0.556361795543455},"children":[{"id":"node-1767870388615","position":{"x":41.271278381347656,"y":67.42619323730469},"size":{"width":151.53582763671875,"height":120.05636596679688},"type":"Container","title":"Subnet","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/30cc96e5e1dccbfc55b9d8e6b525a2684cd5fed0/images/aws/subnet.svg","pan":{"x":-1321.1733870948576,"y":-893.3030464452588,"scale":0.10133077635156906}},{"id":"node-1767870526678","position":{"x":345.9623260498047,"y":56.23759078979492},"size":{"width":158.45675659179688,"height":122.26567077636719},"type":"Container","title":"EC2","description":"1. The Anatomy of an EC2 Instance\nTo launch an EC2, you need to configure four main components:\n\nAMI (Amazon Machine Image): This is your \"Template.\" It contains the Operating System (Windows or Linux) and any software you want pre-installed.\nInstance Type: This defines the hardware (CPU, RAM, Network speed).\nStorage (EBS): The virtual hard drive attached to your server.\nSecurity Groups: A virtual firewall that controls what traffic can enter or leave your server.\n\n2. Understanding Instance Types (The \"Sizes\")\nAWS categorizes EC2 hardware into \"families\" based on their purpose. You can remember them with the mnemonic \"FIGHT DR MC PIX\", but these are the most common:\nFamily\t                   Type\tBest For...\nGeneral Purpose\tT / M\tBalanced CPU/Memory (Web servers, small DBs)\nCompute Optimized\tC\tHigh-performance processors (Batch processing, Media encoding)\nMemory Optimized\tR\tLarge datasets in memory (High-performance DBs, Real-time caching)\nStorage Optimized\tI / D / H\tHigh-speed local storage (Data warehousing)\n\n\n3. EC2 Purchasing Options (The \"Cost\")\nThis is a favorite topic for exams and business owners. How you pay for EC2 depends on your needs:\nOn-Demand: Pay by the second. No long-term commitment. (Best for new apps or short-term jobs).\nReserved Instances (RI): Commit to a 1 or 3-year term. (Up to 72% discount; best for steady-state apps).\nSavings Plans: Flexible commitment to a specific amount of compute usage ($/hour).\nSpot Instances: Bid on \"spare\" AWS capacity. (Up to 90% discount, but AWS can reclaim them with a 2-minute warning. Best for background tasks).\nDedicated Hosts: Physical servers dedicated entirely to you (Best for strict licensing or compliance).\n\n4. The Life Cycle of an EC2\nLaunch: Provisioning the hardware.\nStart/Stop: Like turning a computer off. You stop paying for compute, but you still pay for the storage (EBS).\nTerminate: Deleting the server forever. You stop paying for everything.","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/30cc96e5e1dccbfc55b9d8e6b525a2684cd5fed0/images/aws/ec2.svg"},{"id":"node-1767871063886","position":{"x":369.9208679199219,"y":211.9963836669922},"size":{"width":143.332763671875,"height":112.08212280273438},"type":"Container","title":"EBS","description":"1. What is EBS?\nAmazon EBS is a high-performance storage service designed to be used with EC2. It is called \"persistent\" because the data stays on the drive even if you stop or terminate the EC2 instance (if configured that way).\nAZ-Specific: As we discussed in Global Infrastructure, an EBS volume is created in a specific Availability Zone.\nNetwork-Attached: EBS is not a physical disk inside the server; it is a \"network drive\" that connects to your EC2 over a high-speed connection.\nPoint-in-Time Backups: You can take Snapshots of your EBS volumes, which are stored in S3 for long-term protection.\n\n2. EBS Volume Types\nDepending on your performance needs and budget, you can choose between different \"flavors\" of EBS:\nType\t                              Name\tBest For...\ngp3 / gp2\tGeneral Purpose SSD\tThe default choice. Balanced price/performance for most workloads.\nio2 / io1\tProvisioned IOPS SSD\tCritical, high-speed databases that need extreme performance.\nst1\tThroughput Optimized HDD\tLow-cost storage for frequently accessed, large workloads (Big Data).\nsc1\tCold HDD\tThe cheapest option for data that is rarely accessed.\n\n\n3. EBS vs. Instance Store\nThis is a critical distinction in AWS storage:\nEBS (Persistent): If you stop the server, the data is still there when you turn it back on. Think of it like an external hard drive.\nInstance Store (Ephemeral): This is storage physically attached to the host computer. It is incredibly fast, but if the instance is stopped or the hardware fails, the data is lost forever. Use this only for temporary cache or swap files.\n\n4. Key EBS Features to Remember\nDynamic Increasing: You can increase the size of an EBS volume or change its type while the server is still running (no downtime).\nMulti-Attach: Some io1/io2 volumes can be attached to multiple EC2 instances at the same time (useful for specific cluster applications).\nEncryption: You can encrypt your data at rest with a single click using AWS Key Management Service (KMS).","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/30cc96e5e1dccbfc55b9d8e6b525a2684cd5fed0/images/aws/ebs-volume.svg"}]}]},{"id":"node-1767974424557","position":{"x":1732.392333984375,"y":-482.71378326416016},"size":{"width":834.0701904296875,"height":623.6607894897461},"type":"Container","title":"Route 53","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/2f65613bb08cba2f60960b8144c8bbc6a7dc0bbc/images/aws/route53.svg"},{"id":"node-1767974647834","position":{"x":1702.8961791992188,"y":211.0031280517578},"size":{"width":1023.4652099609375,"height":652.8323974609375},"type":"Container","title":"Cloud Front","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/refs/heads/main/images/aws/cloudfront.svg"},{"id":"node-1767974973266","position":{"x":1702.236831665039,"y":1028.272445678711},"size":{"width":977.450439453125,"height":959.3131408691406},"type":"Container","title":"Glboal Accelerator","iconPath":"https://raw.githubusercontent.com/schemabotview/schemabotview.github.io/6a0e41896557d06d9f52a23947408e345acc21f7/images/aws/global-accelerator.svg"}]}]}]}}