{"id":null,"name":"AWS","data":{"id":"root","size":{"width":1728,"height":996},"pan":{"x":1646.930456914336,"y":701.166277419057,"scale":2.1767960057717413},"children":[{"id":"node-1767794057986","position":{"x":1023,"y":579},"size":{"width":1381,"height":829},"type":"Container","title":"AWS","pan":{"x":-652.2677414606339,"y":-251.49258372560723,"scale":0.30173236488944827},"children":[{"id":"node-1767794185016","position":{"x":-749.4972715377808,"y":-76.61624908447266},"size":{"width":2209.4461059570312,"height":2236.477096557617},"type":"TextBox","title":"About","content":"1. What is Cloud Computing?\nAt its simplest, Cloud Computing is the on-demand delivery of IT resources over the internet with pay-as-you-go pricing. Instead of buying, owning, and maintaining physical data centers and servers, you access technology services, such as computing power, storage, and databases, from a provider like AWS.\n\nKey Characteristics:\nOn-Demand Self-Service: You can provision resources (like a server) with a few clicks whenever you need them.\n\nPay-as-you-go: You only pay for what you use, turning capital expenses (CapEx) into variable expenses (OpEx).\n\nElasticity: You can scale up (add more power) or scale down (remove power) instantly based on demand.\n\nAgility: It allows you to innovate faster because you can experiment and deploy applications in minutes rather than weeks.\n\n2. Brief Introduction to AWS\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. Launched in 2006, it was the first major player in the cloud market and currently offers over 200 fully featured services from data centers globally.\n\nWhy AWS?\nExperience: Being the pioneer, AWS has the most mature and refined service offerings.\n\nBreadth and Depth: From basic virtual servers to advanced Artificial Intelligence, Machine Learning, and Internet of Things (IoT) tools.\n\nSecurity: AWS is architected to be the most flexible and secure cloud computing environment available today.\n\nGlobal Footprint: It provides the largest global infrastructure, allowing you to deploy your applications to users around the world with minimal latency.","color":"transparent"},{"id":"node-1767794337597","position":{"x":1549.6771545410156,"y":147.2193145751953},"size":{"width":2385.8263549804688,"height":1451.2893371582031},"type":"Container","title":"Global Architecture","pan":{"x":-1455.6945802701593,"y":-639.5852318584273,"scale":0.30735251006302833},"children":[{"id":"node-1767794472661","position":{"x":-1542.4576416015625,"y":-433.4329261779785},"size":{"width":3752.781051635742,"height":4004.154266357422},"type":"TextBox","title":"About","content":"1. The AWS Global Footprint\nAWS does not just have \"one big cloud.\" It is a massive network of interconnected hardware distributed across the planet. This architecture is organized into a specific hierarchy:\n\nA. Regions\nA Region is a physical location in the world where AWS has a cluster of data centers.\n\nNaming: They have names like us-east-1 (N. Virginia) or eu-west-2 (London).\n\nIsolation: Each Region is completely independent. Data does not move between regions unless you explicitly tell it to.\n\nSelection Criteria: You choose a region based on Compliance (data laws), Proximity (closeness to your users), and Cost (prices vary by region).\n\nB. Availability Zones (AZs)\nInside every Region, there are multiple Availability Zones. An AZ is one or more discrete data centers with redundant power, networking, and connectivity.\n\nThe \"Magic\" Number: Almost every region has at least 3 AZs.\n\nRedundancy: AZs are physically separated by miles (to protect against fires or floods) but connected by ultra-fast, low-latency private fiber.\n\nHigh Availability: By launching your app in two or more AZs, your app stays online even if one entire data center fails.\n\n2. The Service Scope Model\nFollowing your requested model, we categorize services based on where they \"live\" in this architecture:\n\nGlobal Services\nThese services are managed by AWS at a global level. You don't pick a region for them.\n\nIAM: Users and permissions are the same worldwide.\n\nRoute 53: AWS’s global DNS (Domain Name System) service.\n\nCloudFront: A Content Delivery Network (CDN) that uses Edge Locations to cache data closer to users.\n\nRegional Services\nMost services are scoped to a specific region.\n\nS3 (Simple Storage Service): You create a \"Bucket\" in a specific region. AWS then automatically replicates that data across all AZs in that region.\n\nDynamoDB: A NoSQL database that automatically scales across the region.\n\nAZ-Specific Services\nThese services live inside a single Availability Zone.\n\nEC2 Instances: A virtual server is physically located in one AZ.\n\nEBS Volumes: A virtual hard drive must be in the same AZ as the server it is attached to.\n\nSubnets: When you design a network (VPC), each subnet exists within one specific AZ.","color":"transparent"},{"id":"node-1767794519228","position":{"x":2557.7923583984375,"y":372.10790634155273},"size":{"width":3759.139434814453,"height":2412.9624633789062},"type":"Container","title":"Region","children":[{"id":"node-1767794717813","position":{"x":-125.66381072998047,"y":210.00116729736328},"size":{"width":1538.6153564453125,"height":1636.2116088867188},"type":"TextBox","title":"About","content":"1. What is an AWS Region?\nA Region is a physical location in the world where AWS has a cluster of data centers. Each Region is designed to be completely isolated from the others.\n\nRegional Scope: When you create a resource in a region, it stays in that region. For example, an S3 bucket in London does not automatically exist in New York.\n\nData Sovereignty: Regions allow you to keep data within specific borders to comply with local laws (e.g., GDPR in Europe).\n\n2. Core Regional Services\nThese services operate at the Regional level. This means AWS handles the replication across multiple Availability Zones (AZs) for you automatically to ensure high availability.\n\nA. Amazon S3 (Simple Storage Service)\nRole: Object storage (files, images, backups).\n\nRegional Nature: When you upload a file to an S3 bucket, AWS automatically replicates that file across at least three Availability Zones within that Region. If one data center goes down, your file is still safe.\n\nB. Amazon DynamoDB\nRole: A fast NoSQL database.\n\nRegional Nature: It is a \"Regional Service\" because you don't pick a specific server or AZ for it. It lives across the entire Region, providing massive scale and 99.99% durability.\n\nC. AWS Lambda\nRole: \"Serverless\" compute. You upload code, and it runs in response to events.\n\nRegional Nature: You deploy the function to a Region. AWS manages the underlying servers across the AZs to make sure your code runs when needed.\n\nD. Amazon VPC (Virtual Private Cloud)\nRole: Your private network in the cloud.\n\nRegional Nature: A VPC spans the entire Region. While you will later put \"Subnets\" into specific AZs, the VPC itself is a Regional container for your network."}]}]}]}]}}