{"id":null,"name":"AWS","data":{"id":"root","size":{"width":1728,"height":996},"pan":{"x":862,"y":487,"scale":1},"children":[{"id":"node-1767794057986","position":{"x":1023,"y":579},"size":{"width":1381,"height":829},"type":"Container","title":"AWS","children":[{"id":"node-1767794185016","position":{"x":1523.9195861816406,"y":35.805503845214844},"size":{"width":1280.926025390625,"height":1420.3787078857422},"type":"TextBox","title":"About","content":"1. What is Cloud Computing?\nAt its simplest, Cloud Computing is the on-demand delivery of IT resources over the internet with pay-as-you-go pricing. Instead of buying, owning, and maintaining physical data centers and servers, you access technology services, such as computing power, storage, and databases, from a provider like AWS.\n\nKey Characteristics:\nOn-Demand Self-Service: You can provision resources (like a server) with a few clicks whenever you need them.\n\nPay-as-you-go: You only pay for what you use, turning capital expenses (CapEx) into variable expenses (OpEx).\n\nElasticity: You can scale up (add more power) or scale down (remove power) instantly based on demand.\n\nAgility: It allows you to innovate faster because you can experiment and deploy applications in minutes rather than weeks.\n\n2. Brief Introduction to AWS\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. Launched in 2006, it was the first major player in the cloud market and currently offers over 200 fully featured services from data centers globally.\n\nWhy AWS?\nExperience: Being the pioneer, AWS has the most mature and refined service offerings.\n\nBreadth and Depth: From basic virtual servers to advanced Artificial Intelligence, Machine Learning, and Internet of Things (IoT) tools.\n\nSecurity: AWS is architected to be the most flexible and secure cloud computing environment available today.\n\nGlobal Footprint: It provides the largest global infrastructure, allowing you to deploy your applications to users around the world with minimal latency.","color":"transparent"},{"id":"node-1767794337597","position":{"x":-20.106231689453125,"y":227.19586181640625},"size":{"width":1486.5187377929688,"height":1007.4992980957031},"type":"Container","title":"Global Architecture"}]}]}}