{"id":null,"name":"English","data":{"id":"root","size":{"width":1571,"height":905},"pan":{"x":522.837536012995,"y":745.2303859193258,"scale":29.481592542074292},"children":[{"id":"node-1767256001488","position":{"x":325.66351318359375,"y":590.5457153320312},"size":{"width":532.8840942382812,"height":552.439697265625},"type":"Container","title":"English","pan":{"x":-779.8678101612703,"y":-976.4837109380369,"scale":0.1391948314038633},"children":[{"id":"node-1767256155435","position":{"x":949.5792007446289,"y":2696.188991546631},"size":{"width":391.8100128173828,"height":209.03515625},"type":"TextBox","title":"Intro","description":"English is a global lingua franca and a West Germanic language that evolved in medieval England. Today, it is the primary language of international business, science, and technology. With over 1.5 billion speakers, learning English connects you to a vast world of culture, travel, and professional opportunity.","content":"English is a West Germanic language that originated in early medieval England. \nWhile it started on a small island, it has become the world’s most widely spoken language. \nIt is unique because its vocabulary is a \"melting pot\"—about 26% comes from Germanic roots, but nearly 58% comes from French and Latin.\n\nThe Global Lingua Franca\nEnglish is known as a lingua franca, meaning it is the common language used by people who do not share a native tongue.\nOfficial Language: It is the official language of 67 different countries.\nPrimary Domains: It is the \"universal language\" of international business, aviation, science, technology, and the internet.\n\nSpeaker Count: There are roughly 1.5 billion English speakers worldwide, but only about 400 million are native speakers. \nThis means most English conversations happen between non-native speakers!\n\nVarieties of English\nEnglish isn't just one \"thing.\" Depending on where you are, the accent, spelling, and vocabulary change. \n\nThe two most common standards taught are:\nBritish English (BrE): e.g., Colour, Centre, Lift.\nAmerican English (AmE): e.g., Color, Center, Elevator.","pan":{"scale":1}},{"id":"node-1767281360978","position":{"x":299.6280822753906,"y":2186.5234184265137},"size":{"width":1639.2378845214844,"height":431.2423553466797},"type":"Container","title":"Foundations","pan":{"x":-136.048631725186,"y":56.58438660078966,"scale":2.636295238325064},"children":[{"id":"node-1767281705076","position":{"x":-67.58063608407974,"y":84.00379180908203},"size":{"width":149.8934097290039,"height":78.30274963378906},"type":"TextBox","title":"Sounds","content":"English is not a \"phonetic\" language—meaning we don't always say a word the way it's spelled \n\nConsonants (24 Sounds)\nConsonant sounds are made by restricting airflow using your lips, teeth, or tongue.\nVoiced: Your vocal cords vibrate (e.g., /b/ in \"bat\", /v/ in \"van\").\nVoiceless: No vibration, just air (e.g., /p/ in \"pat\", /f/ in \"fan\").\nDigraphs: Two letters making one sound (e.g., /sh/ in \"ship\", /th/ in \"think\").\n\nVowels (20 Sounds)\nVowels are the \"musical\" part of the language where air flows freely. \nEven though we only have 5 vowel letters (A, E, I, O, U), they create 20 sounds:\nShort Vowels: Quick sounds like /æ/ in \"cat\" or /ɪ/ in \"sit\".\nLong Vowels: Stretched sounds like /iː/ in \"sheep\" or /uː/ in \"blue\".\nThe Schwa ( /ə/ ): The most common sound in English! \nIt’s a weak, neutral sound often found in unstressed syllables (like the \"a\" in about or the \"e\" in teacher).\n\n3. Diphthongs (The \"Gliding\" Vowels)\nThese occur when two vowel sounds \"glide\" together in one syllable to create a new sound.\nExamples: /aɪ/ as in \"sky\", /ɔɪ/ as in \"boy\", and /eɪ/ as in \"face\".\n\nIPA Chart : https://www.internationalphoneticassociation.org/IPAcharts/IPA_charts_TI/IPA_charts_TI.html#eng\n\n","pan":{"scale":1}},{"id":"node-1767281729891","position":{"x":111.93817138671875,"y":84.17904663085938},"size":{"width":144.0842742919922,"height":79.39457702636719},"type":"TextBox","title":"Letters","content":"Alphabet Name: How we say the letter when spelling (e.g., \"A\" sounds like \"Ay\").\nLetter Sound: How the letter actually sounds in a word (e.g., the \"A\" in \"apple\" sounds like /æ/).\n\nThe Alphabet Breakdown\nThe English alphabet is divided into two functional groups:\nVowels (5): A, E, I, O, U (and sometimes Y). \nThese are the \"soul\" of every syllable; almost every English word must contain at least one vowel letter.\nConsonants (21): B, C, D, F, G, H, J, K, L, M, N, P, Q, R, S, T, V, W, X, Y, Z.\n\nThe Case System\nEnglish uses a \"dual-case\" system. It is essential for learners to know when to switch between them:\nUppercase (Capital): Used for the start of sentences, the pronoun \"I,\" and Proper Nouns.\nLowercase: Used for everything else.\n\nLetter Combinations (Graphemes)\nSince we have more sounds than letters, English uses \"Graphemes\"—groups of letters that represent a single sound.\nDigraphs: Two letters, one sound (e.g., SH in \"fish\", CH in \"chip\", PH in \"phone\").\nTrigraphs: Three letters, one sound (e.g., TCH in \"watch\", IGH in \"night\").\nSilent Letters: Letters that appear in writing but are not pronounced (e.g., the K in \"knife\" or the W in \"write\").","pan":{"scale":1}},{"id":"node-1767281735667","position":{"x":291.3503646850586,"y":82.24784851074219},"size":{"width":143.8962926864624,"height":81.07769775390625},"type":"TextBox","title":"Syllables","content":"Think of a syllable as a single \"unit\" of pronunciation.\n\nWhat makes a Syllable?\nThe golden rule in English is: One vowel sound = One syllable. \nIt doesn't matter how many letters are in a word; what matters is how many vowel sounds you hear.\nCat: One vowel sound (1 syllable).\nApple: Two vowel sounds (2 syllables: Ap-ple).\nEducation: Four vowel sounds (4 syllables: Ed-u-ca-tion).\n\nWhy do Syllables matter? (The \"Clap\" Test)\nThe Clap Test: Clap every time you hear a beat in a word.\nThe Chin Drop: Put your hand under your chin. Every time your mouth opens for a vowel sound, your chin will drop. Each drop is one syllable.\n\nWord Stress (The \"Key\" to English Rhythm)\nThis is the most important part of teaching syllables. In English, we do not say every syllable with the same strength. \nOne syllable is always louder, longer, and higher in pitch.\nPHO-to-graph (Stress on 1st)\npho-TOG-ra-pher (Stress on 2nd)\npho-to-GRAPH-ic (Stress on 3rd)\n\nChanging the stress can sometimes change the meaning. For example:\nRE-cord (Noun: a music disc)\nre-CORD (Verb: to film or tape something)","pan":{"scale":1}},{"id":"node-foundation-new-1","type":"TextBox","title":"Intonation & Flow","content":"Intonation: The 'music' of the language. Pitch rising or falling changes meaning (Questions go up, Statements go down).\nConnected Speech: Native speakers link words together.\nLinking: 'Black cat' -> 'Blackat'.\nElision: Dropping sounds (e.g., 'Next day' -> 'Nex day').","pan":{"scale":1}}]},{"id":"node-1767416910314","position":{"x":68.03045463562012,"y":1318.1969060897827},"size":{"width":2125.693588256836,"height":802.5202045440674},"type":"Container","title":"Lexics","pan":{"x":-359.5950692857737,"y":10.652469088102107,"scale":1.4466809199576272},"children":[{"id":"node-1767416975785","position":{"x":-174.27405738830566,"y":119.57779693603516},"size":{"width":216.95660400390625,"height":108.81950378417969},"type":"TextBox","title":"Words","content":"Words act as the bridge between raw letters and meaningful communication.\n\nThe Building Blocks: Morphemes\nA word isn't just a random string of letters; it’s often made of smaller units of meaning called morphemes.\nRoot Words: The core part of the word that holds the main meaning (e.g., in \"unplayable,\" the root is play).\nPrefixes: Added to the front to change meaning (e.g., unhappy, redo, preview).\nSuffixes: Added to the end to change the grammatical function (e.g., player [noun], playful [adjective], played [past tense]).\n\nWord Formation Processes\nEnglish is very flexible. We create new words in several ways:\nCompounding: Joining two whole words together (Sun + flower = Sunflower).\nBlending: Mixing parts of words (Smoke + Fog = Smog).\nConversion: Using the same word as different parts of speech (e.g., \"I will email [verb] you\" vs. \"I sent an email [noun]\").\n\nWord Relationships (Lexis)\nSynonyms: Words with similar meanings (Big / Large).\nAntonyms: Words with opposite meanings (Hot / Cold).\nHomophones: Words that sound the same but have different spellings and meanings (Sea / See, Their / There).\n\nCollocations (Natural Word Pairs) - Some words just \"fit\" together naturally in English.\nCorrect: Fast food, Make a mistake, Take a photo.\nNatural but awkward: Quick food, Do a mistake, Make a photo.","pan":{"scale":1}},{"id":"node-1767416994593","position":{"x":103.33812713623047,"y":117.80059814453125},"size":{"width":279.1991271972656,"height":110.3187255859375},"type":"TextBox","title":"Parts of Speech","content":"1. The \"Naming\" Words\nNouns: People, places, things, or ideas (e.g., London, teacher, phone, freedom).\nPronouns: Words that replace nouns to avoid repetition (e.g., he, she, it, they, someone).\n\n2. The \"Action\" Words\nVerbs: These express actions or states of being. They are the engine of the sentence (e.g., run, jump, is, seem).\n\n3. The \"Describing\" Words\nAdjectives: These describe or modify nouns (e.g., blue sky, fast car, happy child).\nAdverbs: These describe verbs, adjectives, or other adverbs. They often end in -ly and tell us how, when, or where (e.g., ran quickly, very cold).\n\n4. The \"Relationship\" Words\nPrepositions: These show the relationship in time or space between words (e.g., on the table, after lunch, between friends).\nConjunctions: These connect words, phrases, or clauses together (e.g., and, but, or, because).\n\n5. The \"Emotion\" Words\nInterjections: Short exclamations used to express strong feelings or sudden emotion (e.g., Ouch!, Wow!, Oh!).","pan":{"scale":1}},{"id":"node-1767417008268","position":{"x":415.07069396972656,"y":111.14787292480469},"size":{"width":221.402099609375,"height":111.40025329589844},"type":"TextBox","title":"Vocabulary","content":"Vocabulary (or Lexis) is the collection of words that a person knows. \nWhile \"Parts of Speech\" teaches you the roles words play, the Vocabulary section focuses on the meaning and usage of those words in real life.\n\n1. Semantic Fields (Word Grouping)\nInstead of learning random words, students should learn words in \"families\" or themes. This makes memorization much easier.\nThemed Lists: Kitchen (stove, whisk, sauté), Emotions (ecstatic, somber, anxious), or Business (revenue, deadline, stakeholder).\n\n2. Synonyms and Antonyms\nThis helps learners vary their speech so they don't use the same word (like \"good\" or \"bad\") repeatedly.\nSynonyms (Similar): Happy → Content, Cheerful, Joyful.\nAntonyms (Opposite): Happy → Sad, Miserable, Depressed.\n\n3. Denotation vs. Connotation\nDenotation: The literal dictionary definition.\nConnotation: The emotional feeling a word carries.\nExample: \"Cheap\" and \"Inexpensive\" both mean low cost, but \"Cheap\" often implies poor quality, whereas \"Inexpensive\" sounds like a good deal.\n\n4. Idioms and Phrasal Verbs\nThese are the most challenging but essential parts of English vocabulary because their meaning cannot be guessed from the individual words.\nIdioms: \"Piece of cake\" (Very easy).\nPhrasal Verbs: A verb + a preposition that creates a new meaning.\nExample: \"Give up\" (Stop trying) vs. \"Give away\" (Donate).","pan":{"scale":1}},{"id":"node-1767877645399","position":{"x":683.0765533447266,"y":106.17955780029297},"size":{"width":228.30963134765625,"height":114.43771362304688},"type":"TextBox","title":"Phrasal Verbs","content":"A phrasal verb is simply a verb + a particle (a preposition or adverb) that creates a meaning different from the original verb.\n\n\nPreposition categories\n1. The \"UP\" Category\nIn English, \"Up\" often signals completion, improvement, or an increase.\nClean up: To clean something completely.\nEat up: To finish all the food on your plate.\nCheer up: To become happier (improving mood).\nSpeak up: To speak louder (increasing volume).\nWarm up: To prepare for exercise or heat something.\n\n2. The \"OFF\" Category\n\"Off\" usually implies separation, departure, or cancellation.\nTake off: To leave the ground (plane) or remove clothing.\nSet off: To start a journey.\nCall off: To cancel an event.\nCut off: To disconnect (like a phone call) or interrupt.\nPut off: To delay or postpone (separating the task from the present time).\n\n3. The \"OUT\" Category\n\"Out\" often means removing something, discovering information, or performing until the end.\nWork out: To exercise or to solve a problem.\nFind out: To discover a fact.\nHand out: To distribute things to a group.\nWear out: To use something until it’s broken or to be very tired.\nRun out: To have none left (e.g., \"We ran out of milk\").\n\n4. The \"DOWN\" Category\n\"Down\" frequently suggests reduction, stopping, or recording.\nCut down: To reduce the amount of something (e.g., \"Cut down on sugar\").\nTurn down: To decrease volume or to reject an offer.\nSettle down: To become calm or start a stable life.\nWrite down: To record information on paper.\nBreak down: To stop working (machinery) or to lose emotional control.\n\n\n5. The \"ON\" Category\n\"On\" usually implies attachment, starting a process, or continuation.\nCarry on / Keep on: To continue doing something.\nTurn on / Switch on: To start a machine or light.\nPut on: To dress yourself or to place something on a surface.\nGet on: To enter a bus, train, or plane (also means to have a good relationship).\nHold on: To wait for a short time.\n\n6. The \"BACK\" Category\n\"Back\" almost always signals a return to a previous state, place, or person.\nGive back: To return something to its owner.\nCall back: To return a telephone call.\nGet back: To return to a place.\nLook back: To think about the past.\nPay back: To return money you borrowed.\n\n7. The \"AWAY\" Category\n\"Away\" suggests distance, disappearance, or continuous/aimless action.\nGo away: To leave a place.\nGive away: To give something for free or to reveal a secret.\nPut away: To place something in its proper storage place (out of sight).\nPass away: A polite way to say someone has died (disappeared from life).\nThrow away: To put something in the trash.\n\n8. The \"THROUGH\" Category\n\"Through\" usually indicates completing a process from start to finish or enduring a difficulty.\nGo through: To experience a difficult situation or to examine something in detail.\nGet through: To finish a task or to successfully contact someone.\nLook through: To read or examine something quickly.\nSleep through: To continue sleeping despite a loud noise or event.\n\n9. The \"IN / INTO\" Category\n\"In\" or \"Into\" typically involves entering, involving yourself, or transforming.\nDrop in: To visit someone without an appointment.\nFill in: To add information to a form or document.\nBreak in: To enter a building by force.\nLook into: To investigate or research (looking \"inside\" a problem).\nTurn into: To become something else (transformation).\n\n\n10. The \"OVER\" Category\n\"Over\" usually implies repetition, thoroughness, or a transition from one side to another.\nLook over: To examine or check something (like a contract).\nThink over: To consider something carefully before making a decision.\nTalk over: To discuss a problem with someone.\nGo over: To review or repeat information to ensure it's understood.\nTake over: To gain control of something (like a company or a task).\n\n11. The \"AROUND / ROUND\" Category\n\"Around\" often suggests aimlessness, lack of purpose, or avoiding a direct path.\nHang around: To stay in a place for no particular reason.\nFool around: To behave in a silly or irresponsible way.\nShop around: To compare prices at different stores before buying.\nGet around: To move from place to place or to avoid a problem.\n\n12. The \"BY\" Category\n\"By\" is often related to closeness (physical or temporal) or briefly stopping.\nStop by / Drop by: To visit someone for a short time.\nGet by: To have just enough money or knowledge to survive a situation.\nStand by: To support someone or to be ready to help.\nGo by: To pass (used for time or physical movement).\n\n13. The \"FOR\" Category\n\"For\" almost always signals purpose, searching, or representation.\nLook for: To search for something lost.\nAsk for: To request something.\nApply for: To make a formal request (like for a job).\nStand for: To represent or mean (e.g., \"NASA stands for...\").\n\n\nAdverb categories\n1. The \"ALONG\" Category (Adverb of Progress/Company)\nThis adverb usually implies accompanying someone or making steady progress.\nGet along: To have a friendly relationship with someone.\nTag along: To go somewhere with someone, especially when uninvited.\nCome along: To accompany someone OR to make progress (e.g., \"How is your project coming along?\").\nPlay along: To pretend to agree with someone or a situation.\n\n2. The \"APART\" Category (Adverb of Separation)\nThis describes the physical or emotional disintegration of something.\nFall apart: To break into pieces or to lose emotional control.\nTake apart: To dismantle something (like a machine) to see how it works.\nTell apart: To be able to see the difference between two similar things.\nPull apart: To separate two things or people by force.\n\n3. The \"AHEAD\" Category (Adverb of Future/Priority)\nThis focuses on planning, time, or being in front.\nPlan ahead: To prepare for the future.\nGet ahead: To be successful in your career or life.\nLook ahead: To think about what will happen in the future.\nGo ahead: To start or continue with a plan.\n\n4. The \"TOGETHER\" Category (Adverb of Unity)\nThis focuses on collecting, organizing, or collaborating.\nGet together: To meet socially.\nPull yourself together: To regain your self-control or composure.\nPut together: To assemble something or create a plan.\nKeep together: To remain as a single group or unit.\n\n\nPrepositional Particle\tMust have an object (a noun or pronoun) following it.\t\n\"I ran into an old friend.\" (You can't just say \"I ran into.\")\n\n\nAdverbial Particle\tOften describes how/where. \nCan often stand alone without an object.\t\"The plane took off.\" (No object needed)\n\n"},{"id":"node-lexics-new-1","type":"TextBox","title":"Meaning & Style","content":"Figurative Language: Using words creatively.\nMetaphor: Comparison without 'like/as' (e.g., 'Time is money').\nSimile: Comparison using 'like/as' (e.g., 'Busy as a bee').\n\nAmbiguity:\nHomonyms: Same spell/sound, different meaning (Bat: Animal vs. Baseball).\nPolysemy: One word with related meanings (Head of body, Head of company).","pan":{"scale":1}},{"id":"node-1768473809474","position":{"x":-170.33266639709473,"y":304.5433769226074},"size":{"width":186.73358058929443,"height":101.74102783203125},"type":"TextBox","title":"Model Verbs","content":"They are \"helper\" verbs that express things like possibility, necessity, or permission.\n1. The Golden Rules of Modals\nBefore learning the meanings, you must know the three grammar rules that apply to all modal verbs:\nNo \"s\" in the third person: We say \"He can,\" not \"He cans.\"\nNo \"to\" after the modal: We say \"I must go,\" not \"I must to go\" (except for ought to).\nNo \"do/does\" in questions: We say \"Can you help?\" not \"Do you can help?\"\n\n2. Categorizing Modals by \"Function\"\nCategory\tModal Verbs\t                        Intensity/Usage\nAbility\t        Can, Could\t                        Can (present), Could (past).\nPermission\tCan, May, Could\t                May is the most formal.\nProbability\tMight, May, Could, Must\tMust is 95% certain; Might is 20% certain.\nAdvice\t        Should, Ought to\t                Suggesting the \"right\" thing to do.\nObligation\tMust, Have to\t                Must (internal/strong); Have to (external rule).\nProhibition\tMust not, Cannot\t                You are not allowed to do it.\n\n\n3. The \"Certainty Scale\"\nOne of the most important uses of modal verbs is showing how sure you are about something.\nLow Certainty: \"It might rain later.\" (Maybe 30% chance)\nMedium Certainty: \"It should rain later.\" (I expect it to happen)\nHigh Certainty: \"It must be raining.\" (I see people with umbrellas; I am 99% sure)\n\n4. Modal Verbs in the Past\nTo use a modal in the past, we use: Modal + Have + Past Participle.\nRegret: \"I should have studied harder.\" (I didn't study, and now I'm sad).\nPast Guess: \"He must have forgotten the meeting.\" (I am sure that's why he isn't here).\nPast Ability: \"I could have won, but I tripped.\" (I had the potential, but it didn't happen).\n\n"}]},{"id":"node-1767417061890","position":{"x":19.533903121948242,"y":629.4871129989624},"size":{"width":2118.142547607422,"height":592.6203765869141},"type":"Container","title":"Syntax","pan":{"x":-108.66094480623485,"y":-11.996268716747373,"scale":1.4773840084998149},"children":[{"id":"node-1767417093849","position":{"x":-30.96221923828125,"y":128.89077758789062},"size":{"width":256.47186279296875,"height":134.0799560546875},"type":"TextBox","title":"Phrases","content":"A phrase is a group of two or more words that functions as a single unit within a sentence. \nThe most important rule  is: A phrase does not have both a subject and a verb. If it had both, it would be a clause!\n\n1. The Anatomy of a Phrase\nEvery phrase has a \"Head Word.\" This is the most important word in the group that determines the phrase's category.\nThe big red bus (Head word: bus — this is a Noun Phrase).\nIs walking (Head word: walking — this is a Verb Phrase).\n\n2. Common Types of Phrases\nA. Noun Phrases (NP)\nIncludes a noun and all its modifiers.\nExample: \"The hungry cat drank the milk.\"\nB. Verb Phrases (VP)\nIncludes a main verb and its helping (auxiliary) verbs.\nExample: \"She has been studying all night.\"\nC. Prepositional Phrases (PP)\nStarts with a preposition and ends with a noun or pronoun. These usually tell us where or when.\nExample: \"The keys are on the wooden table.\"\nD. Adjective Phrases\nA group of words that describes a noun.\nExample: \"The movie was really very exciting.\"","pan":{"scale":1}},{"id":"node-1767417102236","position":{"x":265.3790969848633,"y":132.10585021972656},"size":{"width":219.07635498046875,"height":130.06407165527344},"type":"TextBox","title":"Clauses","content":"Clauses are the \"powerhouse\" of the English language. \nWhile a phrase is just a group of words, \na clause is a group of words that contains both a Subject (who/what) and a Predicate (the verb/action).\n\n1. The Two Main Types of Clauses\nFor your learners, the most important distinction is between \"Independent\" and \"Dependent.\"\n\nA. Independent Clauses (The \"Strong\" Clause)\nAn independent clause expresses a complete thought and can stand alone as a full sentence.\nFormula: Subject + Verb = Complete Thought.\nExample: \"She studied.\" (Simple, but complete).\n\nB. Dependent Clauses (The \"Weak\" Clause)\nA dependent clause (also called a subordinate clause) has a subject and a verb, but it cannot stand alone. \nIt leaves the listener waiting for more information. It usually starts with a \"marker word\" (conjunction).\nFormula: Conjunction + Subject + Verb = Incomplete Thought.\nExample: \"Because she studied...\" (The listener asks: \"What happened because she studied?\")\n\n2. The Components of a Clause\nSubject: The person or thing doing the action (e.g., The cat).\nPredicate: The action and everything following it (e.g., slept on the rug).\n\n3. How they combine\nThis is where Syntax starts to get interesting. You can combine these clauses to create different sentence structures:\nIndependent + Independent: \"I like coffee, and he likes tea.\"\nIndependent + Dependent: \"I stayed home because it was raining.\"","pan":{"scale":1}},{"id":"node-1767417102503","position":{"x":579.9642105102539,"y":127.18586730957031},"size":{"width":270.18670654296875,"height":129.6443634033203},"type":"TextBox","title":"Sentences","content":"This is where all the previous units—sounds, words, phrases, and clauses—come together to express a complete, logical thought.\nA sentence must always begin with a capital letter, end with a punctuation mark (. ! ?), and contain at least one independent clause.\n\n1. The 4 Structural Types\nDepending on how many clauses you connect (and what kind), you create one of these four structures:\nSimple Sentence: One independent clause.\nExample: \"The cat slept.\"\nCompound Sentence: Two independent clauses joined by a conjunction (and, but, or).\nExample: \"The cat slept, and the dog barked.\"\nComplex Sentence: One independent clause + at least one dependent clause.\nExample: \"The cat slept because it was tired.\"\nCompound-Complex Sentence: Two or more independent clauses + at least one dependent clause.\nExample: \"The cat slept because it was tired, but the dog stayed awake.\"\n\n2. The 4 Functional Types (Moods)\nThis explains the purpose of the sentence. \nDeclarative: Makes a statement (ends with a period).\nExample: \"The sky is blue.\"\nInterrogative: Asks a question (ends with a question mark).\nExample: \"Is the sky blue?\"\nImperative: Gives a command or request.\nExample: \"Look at the sky.\"\nExclamatory: Expresses strong emotion (ends with an exclamation point).\nExample: \"What a beautiful sky!\"\n\n3. Sentence Anatomy (S-V-O)\nThe most common \"blueprint\" for an English sentence is the Subject-Verb-Object pattern.\nSubject: Who is doing it? (The chef)\nVerb: What is the action? (cooked)\nObject: What is receiving the action? (the meal)","pan":{"scale":1}},{"id":"node-1767417164208","position":{"x":904.4882583618164,"y":124.25056457519531},"size":{"width":283.876220703125,"height":130.37570190429688},"type":"TextBox","title":"Puncuatation","content":"Punctuation tells the reader when to stop, when to pause, and what the tone of the message is.\n1. The \"Big Three\" Terminal Marks\nThese appear at the end of a sentence and define its function.\nPeriod ( . ): The full stop. Used for statements.\nExample: \"The class is over.\"\nQuestion Mark ( ? ): Used at the end of a direct question.\nExample: \"Is the class over?\"\nExclamation Point ( ! ): Used to show strong emotion or urgency.\nExample: \"The class is finally over!\"\n\n2. The Internal Marks (The Pauses)\nThese help organize ideas within a single sentence.\nComma ( , ): The most common mark. It creates a small \"breath\" or pause. We use it to separate items in a list or to join clauses with a conjunction.\nExample: \"I bought milk, bread, and eggs.\"\nSemicolon ( ; ): Used to connect two independent clauses that are closely related in thought, without using a conjunction like \"and\" or \"but.\"\nExample: \"I have a big test tomorrow; I can't go to the movies.\"\nColon ( : ): Used to introduce a list, a quote, or an explanation.\nExample: \"You need three things: a pen, paper, and a brain.\"\nApostrophe ( ' ): Used for two specific jobs: showing possession (John’s car) or creating contractions (Don’t for \"do not\").\n\n3. Punctuation and Meaning\nChanging a punctuation mark can completely change the meaning of a sentence. A famous example used in English teaching is:\nVersion A: \"Let’s eat, Grandma!\" (An invitation to dinner).\nVersion B: \"Let’s eat Grandma!\" (A suggestion to eat the person).","pan":{"scale":1}}]},{"id":"node-1767417325418","position":{"x":4.285064697265625,"y":-285.2888984680176},"size":{"width":2116.8687744140625,"height":848.4761047363281},"type":"Container","title":"Grammer","pan":{"x":88.01412286696117,"y":-23.017300180055884,"scale":1.572277032676573},"children":[{"id":"node-1767417358118","position":{"x":754.6333160400391,"y":74.5941162109375},"size":{"width":204.065185546875,"height":116.21136474609375},"type":"TextBox","title":"Types","content":"English has four main conditional types, categorized by how \"real\" or \"likely\" the situation is.\n\n1. The Zero Conditional (General Truths)\nUsed for facts, scientific laws, or things that are always true.\nFormula: If + Present Simple, [then] Present Simple.\nExample: \"If you heat ice, it melts.\"\n\n2. The First Conditional (Real Possibilities)\nUsed for a specific future situation that is likely to happen.\nFormula: If + Present Simple, [then] Will + Verb.\nExample: \"If it rains tomorrow, I will stay home.\"\n\n3. The Second Conditional (Hypothetical/Imaginary)\nUsed for things that are not true right now or are very unlikely to happen (daydreaming).\nFormula: If + Past Simple, [then] Would + Verb.\nExample: \"If I won the lottery, I would travel the world.\" (Note: \"Won\" is used for the \"if\" clause, but we are talking about the present/future).\n\n4. The Third Conditional (Past Regrets)\nUsed for a past situation that did not happen. It is often used to express regret or imagine a different past.\nFormula: If + Past Perfect, [then] Would Have + Past Participle.\nExample: \"If I had studied harder, I would have passed the exam.\" (Reality: I didn't study, and I didn't pass).","pan":{"scale":1}},{"id":"node-1767417358560","position":{"x":1003.6395568847656,"y":74.69925689697266},"size":{"width":205.3614501953125,"height":117.23661804199219},"type":"TextBox","title":"Moods","content":"In grammar, \"Mood\" refers to the speaker's attitude or the \"manner\" in which a thought is expressed. \nIt tells the listener if you are stating a fact, giving an order, or imagining something.\n\nThere are three primary moods in English:\n\n1. The Indicative Mood (Facts)\nThis is the most common mood. It is used to state facts, opinions, or ask simple questions.\nPurpose: To be objective and informative.\nExample: \"The sun rises in the east.\"\nExample: \"He is a student.\"\n\n2. The Imperative Mood (Commands)\nThis mood is used to give orders, instructions, or make strong requests. The subject \"You\" is usually hidden (understood).\nPurpose: To direct behavior.\nExample: \"Close the door.\"\nExample: \"Please sit down.\"\n\n3. The Subjunctive Mood (Wishes & Possibilities)\nThis is the most \"advanced\" mood. It is used to express wishes, hypothetical situations, or things that are contrary to fact. It often uses a special verb form (like \"were\" instead of \"was\").\nPurpose: To express a dream, a doubt, or a demand.\nExample: \"If I were you, I wouldn't do that.\" (Hypothetical)\nExample: \"I suggest that he arrive on time.\" (Recommendation)","pan":{"scale":1}},{"id":"node-1767417358978","position":{"x":504.9340515136719,"y":78.00094604492188},"size":{"width":203.7158203125,"height":111.78437805175781},"type":"TextBox","title":"Voices","content":"Voices describe the relationship between the action (the verb) and the person or thing performing that action (the subject).\n\nThere are two voices in English: Active and Passive. \nUnderstanding the difference is key to helping your learners control the \"focus\" of their sentences.\n\n1. Active Voice (Direct & Strong)\nIn the active voice, the subject of the sentence performs the action. This is the most common way to speak and write because it is clear and direct.\nFormula: [Subject] + [Verb] + [Object]\nExample: \"The chef (Subject) cooked (Verb) the meal (Object).\"\n\n2. Passive Voice (Indirect & Focused)\nIn the passive voice, the subject receives the action. We use this when the person doing the action is unknown, unimportant, or when we want to emphasize the result rather than the doer.\nFormula: [Object] + [Be-Verb] + [Past Participle] + (by [Subject])\nExample: \"The meal (Object) was cooked (Be-Verb + Participle) by the chef.\"\n\n3. When to use Passive Voice?\nIt is a common mistake for learners to think the Passive Voice is \"wrong.\" It is actually very useful in specific contexts:\nScientific Writing: \"The chemical was heated to 100°C.\" (Who heated it isn't the point).\nNews/Crime: \"A bank was robbed last night.\" (We don't know who did it yet).\nPoliteness/Diplomacy: \"The window was left open\" sounds less accusatory than \"You left the window open!\"","pan":{"scale":1}},{"id":"node-1767417359644","position":{"x":246.5953598022461,"y":79.76594543457031},"size":{"width":213.92483520507812,"height":110.9947509765625},"type":"TextBox","title":"Tenses","content":"Tenses are the most complex part of the Grammar block. \nIf Words are the \"bricks\" and Syntax is the \"blueprint,\" Tenses are the \"clock\" of the language. \nThey tell us exactly when an action happened and whether that action is finished or ongoing.\n\nEnglish has 12 major tenses, organized by Time and Aspect.\n\n1. The Three Time Periods\nEvery tense starts with one of these three:\n\nPast: Something that happened before now.\nPresent: Something happening now or generally true.\nFuture: Something that will happen later.\n\n2. The Four Aspects\nThe \"Aspect\" tells us the nature of the action:\n\nSimple: A one-time or habitual action (e.g., I eat).\nContinuous (Progressive): An ongoing action (e.g., I am eating).\nPerfect: An action completed in relation to another time (e.g., I have eaten).\nPerfect Continuous: An ongoing action that has been happening for a duration (e.g., I have been eating).","pan":{"scale":1}},{"id":"node-grammar-new-1","type":"TextBox","title":"Modals & Speech","content":"Modal Verbs: Auxiliary verbs that express necessity or possibility.\nObligation: Must, Have to.\nAbility: Can, Could.\nPermission: May, Can.\n\nReported Speech: Telling someone what another person said.\nDirect: He said, 'I am busy'.\nIndirect: He said that he was busy (Tense shift back).","pan":{"scale":1}},{"id":"node-1768474867575","position":{"x":243.92092895507812,"y":243.9209442138672},"size":{"width":202.16815185546875,"height":102.65438842773438},"type":"TextBox","title":"Speeches","content":"Speeches allow us to communicate what someone else has said. \nWhile Direct Speech is a literal quote, Indirect (Reported) Speech focuses on the message, adjusted for our current time and place.\n\n\n1. The Core Transformation\nWhen moving from Direct to Indirect speech, three things usually change: Pronouns, Tenses, and Time/Place expressions.\nDirect: \"I am happy here today,\" said Mary.\nIndirect: Mary said (that) she was happy there that day.\n\n2. The Tense \"Backshift\" Rule\nTo report something accurately, we usually move the verb one step back into the past.\nDirect Speech                                             Indirect Speech (Reported)\nPresent Simple (eat)                                  Past Simple (ate)\nPresent Continuous (is eating)                 Past Continuous (was eating)\nPresent Perfect (has eaten)                      Past Perfect (had eaten)\nPast Simple (ate)                                       Past Perfect (had eaten)\nWill (will eat)                                             Would (would eat)\nCan (can eat)                                             Could (could eat)\n\n\n3. Reporting Questions\nQuestions are unique because the word order changes from a \"question\" format back to a \"statement\" format.\nWh- Questions: Keep the question word (Who, What, Where, Why, How).\nDirect: \"Where is the key?\"\nIndirect: He asked where the key was. (Not: where was the key)\nYes/No Questions: Use if or whether.\nDirect: \"Do you like coffee?\"\nIndirect: She asked if I liked coffee.\n\n4. Commands and Requests\nWhen reporting an order or a plea, we use the formula: Reporting Verb + Object + To-Infinitive.\nDirect: \"Sit down!\" the teacher said.\nIndirect: The teacher told us to sit down.\nDirect: \"Please don't smoke,\" she said.\nIndirect: She asked him not to smoke.\n\n5. Reporting Verbs: Adding Flavor\nUsing only \"said\" or \"told\" can be boring. We can use verbs that show the speaker's intent:\nAgreement: admitted, agreed, complained\nInformation: explained, informed, mentioned\nPersuasion: promised, suggested, warned\nIf the original statement is still true (e.g., \"The sun rises in the east\"), you don't have to backshift the tense, but doing so is never wrong!\n\n"},{"id":"node-1768475814957","position":{"x":509.1433639526367,"y":248.3839988708496},"size":{"width":200.53350830078125,"height":100.40164184570312},"type":"TextBox","title":"Gerunds / Infinitives","content":"Think of these as the \"double agents\" of English: they look like verbs, but they function as the subject or object of a sentence.\n\n1. The Gerund (-ing)\nA gerund is the verb + ing (e.g., running, eating, swimming). We use it when we are talking about the activity in general.\nAs a Subject: \"Smoking is bad for your health.\"\nAfter Prepositions: \"He is good at singing.\" (Always use a gerund after a preposition!)\nSpecific Verbs: Some verbs are almost always followed by a gerund:\nEnjoy, finish, avoid, mind, suggest, keep.\nExample: \"I enjoy traveling.\" (Not: \"I enjoy to travel.\")\n\n2. The Infinitive (to + Verb)\nThe infinitive is the \"base\" form of the verb, usually preceded by \"to\" (e.g., to run, to eat). It often expresses purpose or intent.\nTo show Purpose: \"I went to the store to buy milk.\"\nAfter Adjectives: \"It is easy to learn English.\"\nSpecific Verbs: These verbs are usually followed by an infinitive:\nWant, hope, need, decide, promise, plan.\nExample: \"I decided to stay.\" (Not: \"I decided staying.\")\n\n3. The \"Bare\" Infinitive\nSometimes we use the infinitive without \"to.\" This happens mostly after:\nModal Verbs: \"I can speak French.\" (Not: \"I can to speak.\")\nLet & Make: \"She let him go.\" / \"He made me laugh.\"\n\n4. The \"Change of Meaning\" Verbs\nSome verbs can take either a gerund or an infinitive, but the meaning changes completely!\nVerb\t         Followed by Gerund (-ing)\t                                                                Followed by Infinitive (to)\nStop\t        To quit an action. (I stopped smoking.)\t                                        To pause an action to do another. (I stopped to smoke.)\nRemember\tTo have a memory of the past. (I remember locking the door.)\tTo not forget a future task. (Remember to lock the door!)\nTry\t                To experiment with a new method. (Try adding salt.)\t                To make a physical/mental effort. (Try to open the window.)"}]},{"id":"node-1767428499215","position":{"x":246.79115295410156,"y":-864.6194152832031},"size":{"width":1000.3779907226562,"height":514.4159240722656},"type":"Container","title":"Communication","pan":{"x":-310.8087151290543,"y":-149.25744283248008,"scale":0.9564729739677232},"children":[{"id":"node-1767428522365","position":{"x":-110.94513893127441,"y":-43.9507942199707},"size":{"width":616.3730926513672,"height":319.80084228515625},"type":"TextBox","title":"Communication","content":"In the world of English Language Teaching (ELT), we often distinguish between Usage (grammar) and Use (communication). Here are the three main areas you might want to add to make this a \"complete\" curriculum:\n\n1. Pragmatics (Social Language)\nThis is about how we use language in specific contexts. A student can know perfect grammar but still sound rude or strange if they don't understand pragmatics.\nRegister: Choosing between Formal (business) vs. Informal (friends) language.\nPoliteness: How to use \"hedging\" (e.g., \"I was wondering if...\" instead of \"I want...\").\nIdioms & Slang: Cultural expressions that don't follow literal dictionary definitions.\n\n2. Discourse (Flow of Conversation)\nWhile \"Syntax\" covers sentences, Discourse covers how those sentences connect to form a story or a conversation.\nCohesion: Using words like \"However,\" \"Therefore,\" and \"In addition\" to link ideas.\nTurn-taking: The unspoken rules of how to start, maintain, and end a conversation.\nParagraphing: How to organize multiple sentences into a single topic block.\n\n3. The \"Four Skills\"\nMost language certifications (like IELTS or TOEFL) measure a student's ability across four practical domains. You might consider these as the \"Output\" of your grammar blocks:\nReceptive Skills: Reading and Listening.\nProductive Skills: Writing and Speaking.","pan":{"scale":1}},{"id":"node-comm-new-1","type":"TextBox","title":"Writing","content":"Structure:\nIntroduction (Hook + Thesis).\nBody Paragraphs (Topic Sentence + Evidence).\nConclusion (Summary + Final Thought).\n\nGenres:\nNarrative: Telling a story.\nDescriptive: Painting a picture with words.\nExpository: Explaining facts.\nPersuasive: Convincing the reader.","pan":{"scale":1}}]}]}]}}